insert into authors (firstName, lastName, birthDay) values
															("Павел", "Заколодяжный", "1980-10-26"),
															("Антон", "Куликовский", "1983-01-23"),
															("Александр", "Стрельчук", "1979-10-26"),
															("Иван", "Иванов", "1989-10-26"),
															("Петр", "Петров", "1985-10-26"),
															("Николай", "Николаев", "1963-10-26"),
															("Александр", "Пушкин", "1799-06-06"),
															("Евгений", "Евгениев", "1991-10-26"),
															("Тина", "Приходько", "1984-10-26"),
															("Василий", "Васильев", "1989-10-26"),
															("Александр", "Александров", "1980-10-26"),
															("Марк", "Твен", "1835-11-30"),
															("Павел", "Павлов", "1980-10-26"),
															("Зураб", "Зурабов", "1980-10-26"),
															("Инна", "Начальная", "1985-10-26"),
															("Руслан", "Афанасьев", "1978-10-26"),
															("Маргарита", "Васильева", "1986-01-23"),
															("Татьяна", "Стрельчук", "1979-10-26"),
															("Мария", "Иванова", "1989-10-26"),
															("Ольга", "Петрова", "1985-10-26");

insert into books (idAuthor, title) values 	  
											(3, "Первая книга"),
											(3, "Вторая книга"),
											(4, "Первая книга"),
											(4, "Вторая книга"),
											(5, "Первая книга"),
											(5, "Вторая книга"),
											(6, "Первая книга"),
											(6, "Вторая книга"),
											(7, "Первая книга"),
											(7, "Вторая книга"),
											(8, "Первая книга"),
											(8, "Вторая книга"),
											(9, "Сказка о золотом петушке"),
											(10, "Первая книга"),
											(10, "Вторая книга"),
											(11, "Первая книга"),
											(11, "Вторая книга"),
											(12, "Первая книга"),
											(12, "Вторая книга"),
											(13, "Первая книга"),
											(13, "Вторая книга"),
											(14, "Том Сойер"),
											(15, "Первая книга"),
											(15, "Вторая книга"),
											(16, "Первая книга"),
											(16, "Вторая книга"),
											(17, "Первая книга"),
											(17, "Вторая книга"),
											(17, "Третья книга"),
											(17, "Четвертая книга"),
											(18, "Первая книга"),
											(18, "Вторая книга"),
											(19, "Первая книга"),
											(19, "Вторая книга"),
											(20, "Первая книга"),
											(20, "Вторая книга"),
											(21, "Первая книга"),
											(21, "Вторая книга"),
											(22, "Первая книга"),
											(22, "Вторая книга"),
											(22, "Третья книга"),
											(22, "Четвертая книга");

select 	a.lastName as "Фамилия", a.firstName as "Имя", b.title as "Название"
from 
	(select 	atmp.id, atmp.firstName, atmp.lastName
	from authors as atmp
	where (YEAR(CURRENT_DATE) - YEAR(atmp.birthDay)) - (DATE_FORMAT(CURRENT_DATE, '%m%d') < DATE_FORMAT(atmp.birthDay, '%m%d')) between 30 AND 40 
	limit 10) as a
join books as b on a.id = b.idAuthor
order by a.lastName;		